In [1]:
import pandas as pd
from sqlalchemy import create_engine
from glob import glob

engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()

engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()

engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
box_path = "\\Users\\User\\Dropbox\\"

data_path = "../data/"
irreg_path = "../data/irreg/"

year = 2022
quarter = 3
year, quarter

(2022, 3)

### Begin of Irregular quarter

### Irregular Quarter Plus 1

In [2]:
file_name   = 'P1-Stocks.csv'
input_file = irreg_path + file_name
col_names   = ['name']
data_ins = pd.read_csv(input_file, sep=',', header=None, index_col=None, names=col_names)
data_ins

      name
0     name
1      AOT
2     CITY
3   GVREIT
4      IRC
5     KTIS
6       MC
7    OISHI
8     PICO
9      SSC
10   TFFIF
11      UV

In [3]:
file_name   = 'P1-Stocks.csv'
input_file = irreg_path + file_name
col_names   = ['name']
data_ins = pd.read_csv(input_file, sep=',', index_col=None)
data_ins

      name
0      AOT
1     CITY
2   GVREIT
3      IRC
4     KTIS
5       MC
6    OISHI
7     PICO
8      SSC
9    TFFIF
10      UV

In [4]:
names = data_ins["name"].values.tolist()
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

"'AOT', 'CITY', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV'"

In [5]:
sql = '''
SELECT name, COUNT(*) FROM epss 
WHERE name in (%s)
AND ((year = %s AND quarter <= %s + 1)
OR (year = %s - 1 AND quarter > %s + 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name'''
sql = sql % (in_p, year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) FROM epss
WHERE name in ('AOT', 'CITY', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV')
AND ((year = 2022 AND quarter <= 3 + 1)
OR (year = 2022 - 1 AND quarter > 3 + 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [6]:
df = pd.read_sql(sql, conlt)
df

     name  COUNT(*)
0     AOT         3
1  GVREIT         3
2   TFFIF         3

### Irregular Quarter Minus 1

In [15]:
file_name   = 'M1-Stocks.csv'
input_file = irreg_path + file_name
col_names   = ['name']
data_ins = pd.read_csv(input_file, sep=',', index_col=None)
data_ins

      name
0   AEONTS
1      BCT
2    BLAND
3      BTS
4   BTSGIF
5      EPG
6   IMPACT
7    INGRS
8      KYE
9      LHK
10     LPF
11    MACO
12     PTL
13     SFP
14  STANLY
15    TIF1
16    TLGF
17     TMW
18      TR
19    TSTH
20     VGI

In [16]:
names = data_ins["name"].values.tolist()
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

"'AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'INGRS', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI'"

In [17]:
sql = '''
SELECT name, COUNT(*) FROM epss 
WHERE name in (%s)
AND ((year = %s AND quarter <= %s - 1)
OR (year = %s - 1 AND quarter > %s - 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name'''
sql = sql % (in_p, year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) FROM epss
WHERE name in ('AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'INGRS', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI')
AND ((year = 2022 AND quarter <= 3 - 1)
OR (year = 2022 - 1 AND quarter > 3 - 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [18]:
df = pd.read_sql(sql, conlt)
df

Empty DataFrame
Columns: [name, COUNT(*)]
Index: []

### End of Irregular quarter

### Normal Quarter Stocks

In [19]:
irreg_files = sorted(glob('../data/irreg/*.csv'))
irreg_files

['../data/irreg\\M1-Stocks.csv', '../data/irreg\\P1-Stocks.csv']

In [20]:
col_names = ['name']
df_tmp = pd.concat((pd.read_csv(file) for file in irreg_files), ignore_index=True)
df_tmp

      name
0   AEONTS
1      BCT
2    BLAND
3      BTS
4   BTSGIF
5      EPG
6   IMPACT
7    INGRS
8      KYE
9      LHK
10     LPF
11    MACO
12     PTL
13     SFP
14  STANLY
15    TIF1
16    TLGF
17     TMW
18      TR
19    TSTH
20     VGI
21     AOT
22    CITY
23  GVREIT
24     IRC
25    KTIS
26      MC
27   OISHI
28    PICO
29     SSC
30   TFFIF
31      UV

In [21]:
names = df_tmp['name'].values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'INGRS', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI', 'AOT', 'CITY', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV'"

In [24]:
sql = """
SELECT name, COUNT(*) AS quarters 
FROM epss 
WHERE name NOT IN (%s)
AND ((year = %s AND quarter <= %s) OR (year = %s-1 AND quarter >= %s+1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name"""
sql = sql % (in_p, year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) AS quarters
FROM epss
WHERE name NOT IN ('AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'INGRS', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI', 'AOT', 'CITY', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV')
AND ((year = 2022 AND quarter <= 3) OR (year = 2022-1 AND quarter >= 3+1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [25]:
df = pd.read_sql(sql, conlt)
df

Empty DataFrame
Columns: [name, quarters]
Index: []

### End of Normal Quarter stocks

### New stocks with less than 4 quarters EPS

In [26]:
sql = '''
SELECT name, COUNT(*) FROM epss 
WHERE (year = %s AND quarter <= %s) 
OR (year = %s-1 AND quarter > %s)
GROUP BY name 
HAVING MAX(quarter) < 4 
ORDER BY name'''
sql = sql % (year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) FROM epss
WHERE (year = 2022 AND quarter <= 3)
OR (year = 2022-1 AND quarter > 3)
GROUP BY name
HAVING MAX(quarter) < 4
ORDER BY name

In [27]:
df_tmp = pd.read_sql(sql, conlt)
df_tmp

Empty DataFrame
Columns: [name, COUNT(*)]
Index: []

### Delete EPSS record that unmatch with Tickers in PortPg

In [28]:
sql = '''
SELECT *
FROM epss E
WHERE E.ticker_id NOT IN
(SELECT id FROM tickers)
'''
df = pd.read_sql(sql, conpg)
df.shape

(0, 14)

In [29]:
rp = conpg.execute(sql)
rp.rowcount

0

In [30]:
sql = '''
SELECT *
FROM epss
'''
epss = pd.read_sql(sql, conlt)
epss.shape

(7595, 14)

In [31]:
sql = '''
SELECT *
FROM tickers
'''
tickers = pd.read_sql(sql, conpg)
tickers.shape

(403, 9)

In [32]:
df_merge = pd.merge(epss, tickers, on='name', how='outer', indicator = True)
df_merge.shape

(7765, 23)

In [33]:
df_left = df_merge[df_merge['_merge'] == 'left_only']
df_left

Empty DataFrame
Columns: [id_x, name, year, quarter, q_amt, y_amt, aq_amt, ay_amt, q_eps, y_eps, aq_eps, ay_eps, ticker_id, publish_date, id_y, full_name, sector, subsector, market, website, created_at, updated_at, _merge]
Index: []

[0 rows x 23 columns]

In [34]:
name_ary = df_left['name'].unique()
name_ary

array([], dtype=object)

In [36]:
sql = '''
SELECT *
FROM epss
WHERE name IN (%s)
'''
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
errors = pd.read_sql(sql, conlt)
errors

Empty DataFrame
Columns: [id, name, year, quarter, q_amt, y_amt, aq_amt, ay_amt, q_eps, y_eps, aq_eps, ay_eps, ticker_id, publish_date]
Index: []

### Delete YR_PROFITS record that unmatch with Tickers in PortPg

In [37]:
sql = """
SELECT name, sector, subsector 
FROM tickers
"""
tickers = pd.read_sql(sql, conpg)
tickers.shape

(403, 3)

In [38]:
sql = '''
SELECT *
FROM yr_profits
'''
yr_profits = pd.read_sql(sql, conlt)
yr_profits.shape

(5074, 9)

In [39]:
df_merge = pd.merge(yr_profits, tickers, on="name", how="outer", indicator=True)
df_merge.shape

(5249, 12)

In [40]:
df_left = df_merge[df_merge["_merge"] == "left_only"]
df_left.shape

(0, 12)

In [41]:
name_ary = df_left["name"].unique()
name_ary

array([], dtype=object)

In [42]:
sql = '''
SELECT *
FROM yr_profits
WHERE name IN (%s)
'''
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
print(sql)

SELECT *
FROM yr_profits
WHERE name IN ()

In [43]:
errors = pd.read_sql(sql, conlt)
errors

Empty DataFrame
Columns: [id, name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id]
Index: []

In [44]:
sql = '''
DELETE
FROM yr_profits
WHERE name IN (%s)
'''
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
print(sql)

DELETE
FROM yr_profits
WHERE name IN ()

In [45]:
rp = conlt.execute(sql)
rp.rowcount

0

### Profits table

In [47]:
pd.set_option('display.max_rows',None)
sql = '''
SELECT * 
FROM profits
ORDER BY name, year, quarter
'''
profits = pd.read_sql(sql, conmy)
profits.shape

(48, 23)

### End of Delete Profits records

In [48]:
sql = """
SELECT * 
FROM tickers
LIMIT 1"""
tickers = pd.read_sql(sql, conlt)
tickers.dtypes

id             int64
name          object
full_name     object
sector        object
subsector     object
market        object
website       object
created_at    object
updated_at    object
dtype: object

In [49]:
sql = """
SELECT DISTINCT T.sector, T.subsector
FROM profits P
JOIN tickers T ON P.ticker_id = T.id
ORDER BY T.sector, T.subsector
"""
pwc = pd.read_sql(sql, conlt)
pwc

                     sector                               subsector
0      Agro & Food Industry                            Agribusiness
1      Agro & Food Industry                         Food & Beverage
2                Financials                                 Banking
3                Financials                    Finance & Securities
4                Financials                               Insurance
5               Industrials                              Automotive
6               Industrials        Industrial Materials & Machinery
7               Industrials                               Packaging
8               Industrials              Petrochemicals & Chemicals
9               Industrials                Steel and Metal Products
10  Property & Construction                   Construction Services
11  Property & Construction                    Property Development
12  Property & Construction                   Property Fund & REITs
13                Resources                      Energy & Utilities
14                 Services                                Commerce
15                 Services                    Health Care Services
16                 Services              Transportation & Logistics
17               Technology                   Electronic Components
18               Technology  Information & Communication Technology

In [50]:
sql = """
SELECT * 
FROM consensus
LIMIT 1"""
consensus = pd.read_sql(sql, conlt)
consensus

,id,name,price,buy,hold,sell,eps_a,eps_b,pe,pbv,yield,target_price,status,ticker_id,created_at,updated_at
0,2,ADVANC,187.5,13,1,0,8.9,9.63,21.1,6.5,4,239,X,6,2017-07-23 09:50:15.621932,2022-11-16 03:31:14.041994

In [51]:
sql = """
SELECT P.name, year, quarter, C.buy, C.hold, C.sell
FROM profits P
JOIN tickers T ON P.ticker_id = T.id
JOIN consensus C ON C.ticker_id = T.id
ORDER BY C.buy DESC
"""
pwc = pd.read_sql(sql, conlt)
pwc

      name  year  quarter  buy  hold  sell
0      BBL  2022        3   18     0     0
1      TTB  2022        3   16     0     0
2      SCB  2022        3   16     0     0
3      KKP  2022        3   15     1     0
4    SPALI  2022        3   15     0     0
5      KTB  2022        3   14     2     0
6    HMPRO  2022        3   14     1     0
7    PTTEP  2022        3   14     6     0
8   ADVANC  2021        3   13     1     0
9       LH  2022        3   13     0     0
10     BEM  2022        3   13     0     0
11   CPALL  2022        3   13     0     0
12     CPF  2022        3   13     0     0
13    GFPT  2022        3   12     2     0
14    BDMS  2022        3   12     3     0
15      CK  2022        3   12     1     0
16     CPN  2022        3    8     2     0
17    COM7  2022        3    8     1     0
18      AH  2022        3    8     0     0
19      QH  2022        3    7     6     0
20    BCPG  2022        3    7     2     0
21    ICHI  2022        3    7     0     0
22      SC  2022        3    7     0     0
23     JMT  2022        3    7     0     0
24   SAPPE  2022        3    7     0     0
25     NER  2022        3    6     1     0
26     SVI  2022        3    6     0     0
27     III  2022        3    6     0     0
28   BANPU  2022        3    6     1     0
29   SYNEX  2022        3    6     1     0
30    MEGA  2022        3    6     1     0
31  INTUCH  2021        3    5     4     0
32      BH  2022        3    5     5     1
33     BPP  2022        3    5     2     0
34   MAKRO  2022        3    5     4     1
35     CKP  2022        3    5     0     0
36    SIRI  2022        3    5     1     0
37     TFG  2022        3    4     0     0
38     ASK  2022        3    4     0     0
39     KCE  2022        3    3     6     1
40      EA  2022        3    3     3     0
41     KSL  2022        2    2     0     0
42   JMART  2022        3    2     0     0
43   TFFIF  2022        3    1     0     0
44     PTL  2022        1    1     0     0
45   OISHI  2022        3    1     0     0
46     SKR  2022        3    1     0     0
47     AIT  2022        3    1     1     0
48     TTA  2022        3    1     0     0
49     PSH  2022        3    1     6     4
50  AIMIRT  2022        3    1     0     0
51   STARK  2022        3    1     0     0
52    LHFG  2021        3    0     1     0
53  GVREIT  2021        3    0     1     0
54     THG  2022        3    0     0     3
55   FORTH  2022        3    0     0     1

### Delete Profits records by Name

In [52]:
sql = '''
SELECT * 
FROM profits
ORDER BY name, year, quarter'''
profits = pd.read_sql(sql, conlt)
profits.shape

(65, 23)

In [40]:
names = '''
'''.split()
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

''

In [41]:
sql = '''
DELETE FROM profits
WHERE name IN (%s)'''
sql = sql % in_p
print(sql)

DELETE FROM profits
WHERE name IN ()

In [42]:
rp = conlt.execute(sql)
rp.rowcount

0

### Delete profits by year

In [43]:
sql = '''
DELETE FROM profits
WHERE year = 2020'''
#sql = sql % in_p
print(sql)

DELETE FROM profits
WHERE year = 2020

In [44]:
#rp = conlt.execute(sql)
rp.rowcount

0

### End of Delete profits by year